# Завдання 1:

# 🔧 Створи модель BlogPost, що містить такі поля:

# title: обов’язковий рядок, мінімум 5 символів
# content: необов’язковий текст, не більше 500 символів
# tags: список тегів (рядків)
# views: число, що не може бути менше 0
# Використай Field() для опису обмежень.



# Завдання 2.

# Додай кастомний валідатор до title, який перевіряє, що заголовок не містить заборонених слів (наприклад, "спам", "реклама").



# Завдання 3.

# 🔧 Створи модель UserRegistration, що містить:

# username: мінімум 3 символи
# email: повинен закінчуватись на @example.com
# password: обов’язково має містити хоча б одну цифру та одну велику літеру
# ✍️ Напиши валідатори:

# Для перевірки email — лише дозволені домени.
# Для password — складність пароля.